Revit 2027 API
Document.NewFlexPipe Method
Adds a new flexible pipe into the document.
Overload List
Name | Description
NewFlexPipe(IList<XYZ>, FlexPipeType) | Adds a new flexible pipe into the document, using a point array and pipe type.
NewFlexPipe(Connector, Connector, FlexPipeType) | Adds a new flexible pipe into the document, using two connector, and flexible pipe type.
NewFlexPipe(Connector, IList<XYZ>, FlexPipeType) | Adds a new flexible pipe into the document, using a connector, point array and pipe type.
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace